//引用，给一个变量起别名
//基本语法很简单，使用中有注意事项
#include <iostream>
using namespace std;
//注意事项
//引用必须要初始化
//也就是说写引用的代码 到时候你就需要提前想清楚这个引用是给哪个变量用的
//初始化之后的引用不能够改变
void swap(int &a, int &b){
    int temp =a;
    a = b;
    b = temp;
return ;
}
int main (){
    int a =10;
    int &b = a;
    b = 20;
    cout << "a = " << a << endl; //输出20
    cout << "b = " << b << endl; //输出20
    b=b+1;
    cout << "a = " << a << endl; //输出21
    cout << "b = " << b << endl; //输出21
    a=a+1;
    cout << "a = " << a << endl; //输出22
    cout << "b = " << b << endl; //输出21

    int s,d;
    s = 1;
    d = 2;
    swap(s,d);
    cout << "s = " << s << endl; //输出2
    cout << "d = " << d << endl; //输出1


    //引用做函数参数
    //给函数参数有三种
    //一种是值传递，只传递值，不会对实参进行改动   给变量，用变量接受
    //一种是指针传递，可以通过指针运算来对实参进行改动    给变量的指针 &a,用变量类型的指针类来接收
    //还用一种就是引用传递，也是可以对实参进行改动，但是在形式上像值传递，书写方便而且简洁，功能是指针传递的效果 给原变量，用引用变量接收

    return 0;
}