
#include <iostream>
using namespace std;
//常量引用
//const，修饰常量  不可修改，通过给函数的引用形参达到不修改数值的效果，防止变量被篡改

void asb(const int & a){
    //  = 200; //不能修改a的值
    cout << "b=" << a << endl;

}
int main() {
   int a =100;
   asb(a); //调用函数，传递常量引用
   cout << "a=" << a << endl; //a的值没有被修改，因为传递的是常量引用，不能修改a的值
    return 0;
}
//与值传递的区别，值传递至少还能修改形参，但是常量引用根本不能修改形参
//此外两者的开销不同

//
//还有左值右值的问题，不过我不太清楚

//下面我搞清楚了
//首先可以理解为左值是有长久地址的
//右值是临时的，左右和在等式的左边还是右边没有关系
//
//值传递不能直接给一个42这个右值，但是用了常量引用作为函数的返回值之后，就可以给右值赋值了

//就跟视频里面一样，所以这是值传递和常量引用传递的区别

//此外通过这个也是复习了一下左值和右值的概念